Tekla.Structures.Drawing.TeklaDrawingColor
The TeklaDrawingColor struct contains a compact storage for drawing color data
This struct is intended to be an "all-in-one" solution for OpenAPI users interacting with drawing colors.
It supports old enums and new user defined RGB colors. The essential principle of this struct is that once
an object of this struct is created (i.e. you have one of these objects instantiated), it contains valid
RGB information, as well as a valid enum value in the case of a standard color. This means users will never
have to run checks to see if their object has a valid RGB value. After all, if they receive this "TrueColor"
object, they expect we can provide them RGB information.
To support this functionality, we need to make sure that there is RGB information present for every single
object of this type that is created. All objects constructed with RGB values are guaranteed to have this,
as well as the ordinary standard drawing colors with values between 0 and 255. Other indices are forbidden,
and will cause an error upon construction attempt. Given that the constructor of this struct can throw an exception,
the struct should never be used as a "middleman", meaning it should never be used to pass color information
from one place to another within the codebase: int color -> TeklaDrawingColor -> int color.

Tekla.Structures.Drawing.TeklaDrawingColor.#ctor
Default constructor for the struct. Assigns color to standard black.

Tekla.Structures.Drawing.TeklaDrawingColor.#ctor(System.Drawing.Color)
Construct a TeklaDrawingColor instance by passing in an RGB System.Drawing.Color value.
This is the safe non-throwing constructor to use.
RGB: The color to use for instantiating, as a System.Drawing.Color

Tekla.Structures.Drawing.TeklaDrawingColor.#ctor(Tekla.Structures.Drawing.DrawingColors)
Construct a TeklaDrawingColor instance by passing in a Tekla standard color enum value.
Use of this constructor is discouraged, please use TeklaDrawingColor(Color RGB)
Throws System.ArgumentOutOfRangeException: Throws if ColorEnum is not a valid Tekla Standard color
ColorEnum: Color as DrawingColors

Tekla.Structures.Drawing.TeklaDrawingColor.#ctor(Tekla.Structures.Drawing.DrawingHatchColors)
Construct a TeklaDrawingColor instance by passing in a Tekla standard color hatch enum value. Use only for hatches.
ColorEnum: Color as DrawingHatchColors

Tekla.Structures.Drawing.TeklaDrawingColor.RGBColor
Red, Green, Blue representation of the color.

Tekla.Structures.Drawing.TeklaDrawingColor.DrawingColorEnum
Enum for the drawing color

Tekla.Structures.Drawing.TeklaDrawingColor.InternalColorInt
This is just for the to/from struct functionality and some Clone-methods (at least Frame), do not use otherwise